       IDENTIFICATION DIVISION.
       PROGRAM-ID. TRIMR-DISP.
      *> IS INITIAL.

       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       LINKAGE SECTION.
       01 FULL-STRING PIC X(32).

       PROCEDURE DIVISION USING FULL-STRING.
       SUBLINE.
           DISPLAY FULL-STRING.
           EXIT PROGRAM.
       END PROGRAM TRIMR-DISP.

